[Killed] ArrayDeclaration
scripts/scrape.ts:33:96
   const $ = load(html);
   const linkElements = $(source.selectors.articleLink);
 
-  const articles: { source_url: string; article_url: string; title: string; lead: string }[] = [];
+  const articles: { source_url: string; article_url: string; title: string; lead: string }[] = ["Stryker was here"];
 
   linkElements.each((index, el) => {
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: expected undefined to be truthy

[Survived] MethodExpression
scripts/scrape.ts:36:96
   const articles: { source_url: string; article_url: string; title: string; lead: string }[] = [];
 
   linkElements.each((index, el) => {
-    const title = source.selectors.title ? $(source.selectors.title).eq(index).text().trim() : $(el).text().trim();
+    const title = source.selectors.title ? $(source.selectors.title).eq(index).text().trim() : $(el).text();
     if (!title && source.selectors.title) {
       console.warn(`${source.name}: title selector matched nothing at index ${index}`);

[NoCoverage] MethodExpression
scripts/scrape.ts:36:44
   const articles: { source_url: string; article_url: string; title: string; lead: string }[] = [];
 
   linkElements.each((index, el) => {
-    const title = source.selectors.title ? $(source.selectors.title).eq(index).text().trim() : $(el).text().trim();
+    const title = source.selectors.title ? $(source.selectors.title).eq(index).text() : $(el).text().trim();
     if (!title && source.selectors.title) {
       console.warn(`${source.name}: title selector matched nothing at index ${index}`);

[Survived] LogicalOperator
scripts/scrape.ts:37:9
 
   linkElements.each((index, el) => {
     const title = source.selectors.title ? $(source.selectors.title).eq(index).text().trim() : $(el).text().trim();
-    if (!title && source.selectors.title) {
+    if (!title || source.selectors.title) {
       console.warn(`${source.name}: title selector matched nothing at index ${index}`);
     }

[NoCoverage] BlockStatement
scripts/scrape.ts:37:43
 
   linkElements.each((index, el) => {
     const title = source.selectors.title ? $(source.selectors.title).eq(index).text().trim() : $(el).text().trim();
-    if (!title && source.selectors.title) {
-      console.warn(`${source.name}: title selector matched nothing at index ${index}`);
-    }
+    if (!title && source.selectors.title) {}
     const rawHref = $(el).attr("href");
 

[NoCoverage] StringLiteral
scripts/scrape.ts:38:20
   linkElements.each((index, el) => {
     const title = source.selectors.title ? $(source.selectors.title).eq(index).text().trim() : $(el).text().trim();
     if (!title && source.selectors.title) {
-      console.warn(`${source.name}: title selector matched nothing at index ${index}`);
+      console.warn(``);
     }
     const rawHref = $(el).attr("href");

[Killed] ConditionalExpression
scripts/scrape.ts:42:9
     }
     const rawHref = $(el).attr("href");
 
-    if (!rawHref) return;
+    if (true) return;
 
     let article_url: string;
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: expected 0 to be greater than or equal to 1

[Killed] BooleanLiteral
scripts/scrape.ts:42:9
     }
     const rawHref = $(el).attr("href");
 
-    if (!rawHref) return;
+    if (rawHref) return;
 
     let article_url: string;
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: expected 0 to be greater than or equal to 1

[Killed] BlockStatement
scripts/scrape.ts:45:9
     if (!rawHref) return;
 
     let article_url: string;
-    try {
-      article_url = new URL(rawHref, source.url).href;
-    } catch {
+    try {} catch {
       return;
     }
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: .toMatch() expects to receive a string, but got undefined

[NoCoverage] BlockStatement
scripts/scrape.ts:47:13
     let article_url: string;
     try {
       article_url = new URL(rawHref, source.url).href;
-    } catch {
-      return;
-    }
+    } catch {}
 
     let lead = "";

[Survived] StringLiteral
scripts/scrape.ts:51:16
       return;
     }
 
-    let lead = "";
+    let lead = "Stryker was here!";
     if (source.selectors.lead) {
       lead = $(source.selectors.lead).eq(index).text().trim();

[Survived] ConditionalExpression
scripts/scrape.ts:52:9
     }
 
     let lead = "";
-    if (source.selectors.lead) {
+    if (true) {
       lead = $(source.selectors.lead).eq(index).text().trim();
       if (!lead) {

[Survived] ConditionalExpression
scripts/scrape.ts:52:9
     }
 
     let lead = "";
-    if (source.selectors.lead) {
+    if (false) {
       lead = $(source.selectors.lead).eq(index).text().trim();
       if (!lead) {

[NoCoverage] MethodExpression
scripts/scrape.ts:53:14
 
     let lead = "";
     if (source.selectors.lead) {
-      lead = $(source.selectors.lead).eq(index).text().trim();
+      lead = $(source.selectors.lead).eq(index).text();
       if (!lead) {
         console.warn(`${source.name}: lead selector matched nothing at index ${index}`);

[NoCoverage] ConditionalExpression
scripts/scrape.ts:54:11
     let lead = "";
     if (source.selectors.lead) {
       lead = $(source.selectors.lead).eq(index).text().trim();
-      if (!lead) {
+      if (false) {
         console.warn(`${source.name}: lead selector matched nothing at index ${index}`);
       }

[NoCoverage] ConditionalExpression
scripts/scrape.ts:54:11
     let lead = "";
     if (source.selectors.lead) {
       lead = $(source.selectors.lead).eq(index).text().trim();
-      if (!lead) {
+      if (true) {
         console.warn(`${source.name}: lead selector matched nothing at index ${index}`);
       }

[NoCoverage] StringLiteral
scripts/scrape.ts:55:22
     if (source.selectors.lead) {
       lead = $(source.selectors.lead).eq(index).text().trim();
       if (!lead) {
-        console.warn(`${source.name}: lead selector matched nothing at index ${index}`);
+        console.warn(``);
       }
     }

[Killed] ConditionalExpression
scripts/scrape.ts:62:7
     articles.push({ source_url: source.url, article_url, title, lead });
   });
 
-  if (articles.length === 0) {
+  if (false) {
     console.warn(`${source.name}: no articles found — selectors may be broken`);
     return { newCount: 0, duplicateCount: 0 };
killedBy: processSource empty-selector HTML: warns and returns zero counts without calling upsert
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] EqualityOperator
scripts/scrape.ts:62:7
     articles.push({ source_url: source.url, article_url, title, lead });
   });
 
-  if (articles.length === 0) {
+  if (articles.length !== 0) {
     console.warn(`${source.name}: no articles found — selectors may be broken`);
     return { newCount: 0, duplicateCount: 0 };
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: expected 0 to be greater than or equal to 1

[Killed] StringLiteral
scripts/scrape.ts:63:18
   });
 
   if (articles.length === 0) {
-    console.warn(`${source.name}: no articles found — selectors may be broken`);
+    console.warn(``);
     return { newCount: 0, duplicateCount: 0 };
   }
killedBy: processSource empty-selector HTML: warns and returns zero counts without calling upsert
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received:

  1st warn call:

  [
-   StringContaining "no articles found",

[Killed] ArrowFunction
scripts/scrape.ts:67:31
     return { newCount: 0, duplicateCount: 0 };
   }
 
-  const dbRows = articles.map(({ source_url, article_url, title, lead }) => ({
-    source_url,
-    article_url,
-    title,
-    lead,
-  }));
+  const dbRows = articles.map(() => undefined);
 
   const { data, error } = await supabase
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: Cannot read properties of undefined (reading 'title')

[Survived] StringLiteral
scripts/scrape.ts:75:11
   }));
 
   const { data, error } = await supabase
-    .from("articles_seen")
+    .from("")
     .upsert(dbRows, { onConflict: "source_url,article_url", ignoreDuplicates: true })
     .select("id");

[Survived] BooleanLiteral
scripts/scrape.ts:76:79
 
   const { data, error } = await supabase
     .from("articles_seen")
-    .upsert(dbRows, { onConflict: "source_url,article_url", ignoreDuplicates: true })
+    .upsert(dbRows, { onConflict: "source_url,article_url", ignoreDuplicates: false })
     .select("id");
 

[Survived] ObjectLiteral
scripts/scrape.ts:76:21
 
   const { data, error } = await supabase
     .from("articles_seen")
-    .upsert(dbRows, { onConflict: "source_url,article_url", ignoreDuplicates: true })
+    .upsert(dbRows, {})
     .select("id");
 

[NoCoverage] BlockStatement
scripts/scrape.ts:79:14
     .upsert(dbRows, { onConflict: "source_url,article_url", ignoreDuplicates: true })
     .select("id");
 
-  if (error) {
-    console.error(`${source.name}: Supabase error: ${error.message}`);
-    return { newCount: 0, duplicateCount: 0 };
-  }
+  if (error) {}
 
   const newCount = data.length;

[NoCoverage] StringLiteral
scripts/scrape.ts:80:19
     .select("id");
 
   if (error) {
-    console.error(`${source.name}: Supabase error: ${error.message}`);
+    console.error(``);
     return { newCount: 0, duplicateCount: 0 };
   }

[Survived] ArithmeticOperator
scripts/scrape.ts:85:26
   }
 
   const newCount = data.length;
-  const duplicateCount = articles.length - newCount;
+  const duplicateCount = articles.length + newCount;
   return { newCount, duplicateCount };
 }

[Killed] ObjectLiteral
scripts/scrape.ts:86:10
 
   const newCount = data.length;
   const duplicateCount = articles.length - newCount;
-  return { newCount, duplicateCount };
+  return {};
 }
 
killedBy: processSource valid HTML: upserts ≥1 article with non-empty title and URL
statusReason: actual value must be number or bigint, received "undefined"

[Survived] ConditionalExpression
scripts/scrape.ts:90:5
 }
 
 const __filename = fileURLToPath(import.meta.url);
-if (process.argv[1] === __filename) {
+if (true) {
   const supabaseUrl = process.env.SUPABASE_URL;
   const supabaseServiceRoleKey = process.env.SUPABASE_SERVICE_ROLE_KEY;

[Survived] ConditionalExpression
scripts/scrape.ts:90:5
 }
 
 const __filename = fileURLToPath(import.meta.url);
-if (process.argv[1] === __filename) {
+if (false) {
   const supabaseUrl = process.env.SUPABASE_URL;
   const supabaseServiceRoleKey = process.env.SUPABASE_SERVICE_ROLE_KEY;

[NoCoverage] LogicalOperator
scripts/scrape.ts:94:7
   const supabaseUrl = process.env.SUPABASE_URL;
   const supabaseServiceRoleKey = process.env.SUPABASE_SERVICE_ROLE_KEY;
 
-  if (!supabaseUrl || !supabaseServiceRoleKey) {
+  if (!supabaseUrl && !supabaseServiceRoleKey) {
     console.error("Error: SUPABASE_URL and SUPABASE_SERVICE_ROLE_KEY must be set in .env");
     process.exit(1);

[NoCoverage] BooleanLiteral
scripts/scrape.ts:94:23
   const supabaseUrl = process.env.SUPABASE_URL;
   const supabaseServiceRoleKey = process.env.SUPABASE_SERVICE_ROLE_KEY;
 
-  if (!supabaseUrl || !supabaseServiceRoleKey) {
+  if (!supabaseUrl || supabaseServiceRoleKey) {
     console.error("Error: SUPABASE_URL and SUPABASE_SERVICE_ROLE_KEY must be set in .env");
     process.exit(1);

[NoCoverage] BlockStatement
scripts/scrape.ts:100:7
   }
 
   let sources: SourceConfig;
-  try {
-    const raw = readFileSync("sources.json", "utf-8");
-    sources = SourceConfigSchema.parse(JSON.parse(raw));
-  } catch (err) {
+  try {} catch (err) {
     console.error("Error loading sources.json:", err instanceof Error ? err.message : String(err));
     process.exit(1);

[NoCoverage] BlockStatement
scripts/scrape.ts:103:17
   try {
     const raw = readFileSync("sources.json", "utf-8");
     sources = SourceConfigSchema.parse(JSON.parse(raw));
-  } catch (err) {
-    console.error("Error loading sources.json:", err instanceof Error ? err.message : String(err));
-    process.exit(1);
-  }
+  } catch (err) {}
 
   const supabase = createScriptClient(supabaseUrl, supabaseServiceRoleKey);

[NoCoverage] StringLiteral
scripts/scrape.ts:110:15
 
   const supabase = createScriptClient(supabaseUrl, supabaseServiceRoleKey);
 
-  console.log("Scraper starting…");
+  console.log("");
 
   let totalNew = 0;

[NoCoverage] BlockStatement
scripts/scrape.ts:116:9
   let totalDuplicates = 0;
 
   for (const source of sources) {
-    try {
-      const controller = new AbortController();
-      const timeout = setTimeout(() => {
-        controller.abort();
-      }, 10_000);
-
-      let html: string;
-      // AbortController only aborts the TCP connection phase; response.text() body read
-      // is not bounded by the signal. Accepted limitation for manually-run news scraping.
-      try {
-        const response = await fetch(source.url, { signal: controller.signal });
-        if (!response.ok) throw new Error(`HTTP ${response.status}`);
-        html = await response.text();
-      } finally {
-        clearTimeout(timeout);
-      }
-
-      const { newCount, duplicateCount } = await processSource(html, source, supabase);
-      totalNew += newCount;
-      totalDuplicates += duplicateCount;
-      if (newCount > 0 || duplicateCount > 0) {
-        console.log(`${source.name}: ${newCount} nowych, ${duplicateCount} duplikatów`);
-      }
-    } catch (err) {
+    try {} catch (err) {
       console.error(`${source.name}: Error: ${err instanceof Error ? err.message : String(err)}`);
     }

[NoCoverage] BlockStatement
scripts/scrape.ts:118:40
   for (const source of sources) {
     try {
       const controller = new AbortController();
-      const timeout = setTimeout(() => {
-        controller.abort();
-      }, 10_000);
+      const timeout = setTimeout(() => {}, 10_000);
 
       let html: string;

[NoCoverage] BlockStatement
scripts/scrape.ts:125:11
       let html: string;
       // AbortController only aborts the TCP connection phase; response.text() body read
       // is not bounded by the signal. Accepted limitation for manually-run news scraping.
-      try {
-        const response = await fetch(source.url, { signal: controller.signal });
-        if (!response.ok) throw new Error(`HTTP ${response.status}`);
-        html = await response.text();
-      } finally {
+      try {} finally {
         clearTimeout(timeout);
       }

[NoCoverage] BooleanLiteral
scripts/scrape.ts:127:13
       // is not bounded by the signal. Accepted limitation for manually-run news scraping.
       try {
         const response = await fetch(source.url, { signal: controller.signal });
-        if (!response.ok) throw new Error(`HTTP ${response.status}`);
+        if (response.ok) throw new Error(`HTTP ${response.status}`);
         html = await response.text();
       } finally {

[NoCoverage] ConditionalExpression
scripts/scrape.ts:127:13
       // is not bounded by the signal. Accepted limitation for manually-run news scraping.
       try {
         const response = await fetch(source.url, { signal: controller.signal });
-        if (!response.ok) throw new Error(`HTTP ${response.status}`);
+        if (true) throw new Error(`HTTP ${response.status}`);
         html = await response.text();
       } finally {

[NoCoverage] BlockStatement
scripts/scrape.ts:129:17
         const response = await fetch(source.url, { signal: controller.signal });
         if (!response.ok) throw new Error(`HTTP ${response.status}`);
         html = await response.text();
-      } finally {
-        clearTimeout(timeout);
-      }
+      } finally {}
 
       const { newCount, duplicateCount } = await processSource(html, source, supabase);

[NoCoverage] AssignmentOperator
scripts/scrape.ts:134:7
       }
 
       const { newCount, duplicateCount } = await processSource(html, source, supabase);
-      totalNew += newCount;
+      totalNew -= newCount;
       totalDuplicates += duplicateCount;
       if (newCount > 0 || duplicateCount > 0) {

[NoCoverage] AssignmentOperator
scripts/scrape.ts:135:7
 
       const { newCount, duplicateCount } = await processSource(html, source, supabase);
       totalNew += newCount;
-      totalDuplicates += duplicateCount;
+      totalDuplicates -= duplicateCount;
       if (newCount > 0 || duplicateCount > 0) {
         console.log(`${source.name}: ${newCount} nowych, ${duplicateCount} duplikatów`);

[NoCoverage] EqualityOperator
scripts/scrape.ts:136:27
       const { newCount, duplicateCount } = await processSource(html, source, supabase);
       totalNew += newCount;
       totalDuplicates += duplicateCount;
-      if (newCount > 0 || duplicateCount > 0) {
+      if (newCount > 0 || duplicateCount >= 0) {
         console.log(`${source.name}: ${newCount} nowych, ${duplicateCount} duplikatów`);
       }

[NoCoverage] BlockStatement
scripts/scrape.ts:136:47
       const { newCount, duplicateCount } = await processSource(html, source, supabase);
       totalNew += newCount;
       totalDuplicates += duplicateCount;
-      if (newCount > 0 || duplicateCount > 0) {
-        console.log(`${source.name}: ${newCount} nowych, ${duplicateCount} duplikatów`);
-      }
+      if (newCount > 0 || duplicateCount > 0) {}
     } catch (err) {
       console.error(`${source.name}: Error: ${err instanceof Error ? err.message : String(err)}`);

[NoCoverage] BlockStatement
scripts/scrape.ts:139:19
       if (newCount > 0 || duplicateCount > 0) {
         console.log(`${source.name}: ${newCount} nowych, ${duplicateCount} duplikatów`);
       }
-    } catch (err) {
-      console.error(`${source.name}: Error: ${err instanceof Error ? err.message : String(err)}`);
-    }
+    } catch (err) {}
   }
 

[NoCoverage] StringLiteral
scripts/scrape.ts:144:15
     }
   }
 
-  console.log("---");
+  console.log("");
   console.log(`Łącznie: ${totalNew} nowych, ${totalDuplicates} duplikatów`);
 }
