[Survived] BlockStatement
scripts/send.ts:29:35
   fromEmail: string,
 ): Promise<{ failedCount: number }> {
   const grouped = new Map<string, Article[]>();
-  for (const article of articles) {
-    const host = new URL(article.source_url).hostname;
-    const group = grouped.get(host) ?? [];
-    group.push(article);
-    grouped.set(host, group);
-  }
+  for (const article of articles) {}
 
   const subject = `Digest — ${articles.length} nowych artykułów — ${new Date().toLocaleDateString("pl-PL")}`;

[Killed] LogicalOperator
scripts/send.ts:31:19
   const grouped = new Map<string, Article[]>();
   for (const article of articles) {
     const host = new URL(article.source_url).hostname;
-    const group = grouped.get(host) ?? [];
+    const group = grouped.get(host) && [];
     group.push(article);
     grouped.set(host, group);
killedBy: runDigest Resend error: returns failedCount equal to subscribers count
statusReason: Cannot read properties of undefined (reading 'push')

[Survived] StringLiteral
scripts/send.ts:36:19
     grouped.set(host, group);
   }
 
-  const subject = `Digest — ${articles.length} nowych artykułów — ${new Date().toLocaleDateString("pl-PL")}`;
+  const subject = ``;
 
   let html = `<h1>${subject}</h1>`;

[Survived] StringLiteral
scripts/send.ts:38:14
 
   const subject = `Digest — ${articles.length} nowych artykułów — ${new Date().toLocaleDateString("pl-PL")}`;
 
-  let html = `<h1>${subject}</h1>`;
+  let html = ``;
   for (const [hostname, group] of grouped) {
     html += `<h2>${hostname}</h2>`;

[Survived] BlockStatement
scripts/send.ts:39:44
   const subject = `Digest — ${articles.length} nowych artykułów — ${new Date().toLocaleDateString("pl-PL")}`;
 
   let html = `<h1>${subject}</h1>`;
-  for (const [hostname, group] of grouped) {
-    html += `<h2>${hostname}</h2>`;
-    for (const article of group) {
-      const titleText = article.title ?? article.article_url;
-      html += `<p><strong><a href="${article.article_url}">${titleText}</a></strong></p>`;
-      if (article.lead) {
-        html += `<p>${article.lead}</p>`;
-      }
-    }
-  }
+  for (const [hostname, group] of grouped) {}
 
   let failedCount = 0;

[Survived] BlockStatement
scripts/send.ts:41:34
   let html = `<h1>${subject}</h1>`;
   for (const [hostname, group] of grouped) {
     html += `<h2>${hostname}</h2>`;
-    for (const article of group) {
-      const titleText = article.title ?? article.article_url;
-      html += `<p><strong><a href="${article.article_url}">${titleText}</a></strong></p>`;
-      if (article.lead) {
-        html += `<p>${article.lead}</p>`;
-      }
-    }
+    for (const article of group) {}
   }
 

[Survived] LogicalOperator
scripts/send.ts:42:25
   for (const [hostname, group] of grouped) {
     html += `<h2>${hostname}</h2>`;
     for (const article of group) {
-      const titleText = article.title ?? article.article_url;
+      const titleText = article.title && article.article_url;
       html += `<p><strong><a href="${article.article_url}">${titleText}</a></strong></p>`;
       if (article.lead) {

[Survived] ConditionalExpression
scripts/send.ts:44:11
     for (const article of group) {
       const titleText = article.title ?? article.article_url;
       html += `<p><strong><a href="${article.article_url}">${titleText}</a></strong></p>`;
-      if (article.lead) {
+      if (false) {
         html += `<p>${article.lead}</p>`;
       }

[Survived] ConditionalExpression
scripts/send.ts:44:11
     for (const article of group) {
       const titleText = article.title ?? article.article_url;
       html += `<p><strong><a href="${article.article_url}">${titleText}</a></strong></p>`;
-      if (article.lead) {
+      if (true) {
         html += `<p>${article.lead}</p>`;
       }

[Killed] BlockStatement
scripts/send.ts:51:36
   }
 
   let failedCount = 0;
-  for (const email of subscribers) {
-    const { data, error } = await resend.emails.send({
-      from: fromEmail,
-      to: [email],
-      subject,
-      html,
-    });
-    if (error) {
-      console.error(`${email}: Resend error:`, error.message);
-      failedCount++;
-    } else {
-      console.log(`${email}: wysłano (id: ${data.id})`);
-    }
-  }
+  for (const email of subscribers) {}
 
   const { error: updateError } = await supabase
killedBy: runDigest Resend error: returns failedCount equal to subscribers count
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
scripts/send.ts:58:16
       subject,
       html,
     });
-    if (error) {
-      console.error(`${email}: Resend error:`, error.message);
-      failedCount++;
-    } else {
+    if (error) {} else {
       console.log(`${email}: wysłano (id: ${data.id})`);
     }
killedBy: runDigest Resend error: returns failedCount equal to subscribers count
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
scripts/send.ts:58:9
       subject,
       html,
     });
-    if (error) {
+    if (false) {
       console.error(`${email}: Resend error:`, error.message);
       failedCount++;
killedBy: runDigest Resend error: returns failedCount equal to subscribers count
statusReason: Cannot read properties of null (reading 'id')

[Killed] UpdateOperator
scripts/send.ts:60:7
     });
     if (error) {
       console.error(`${email}: Resend error:`, error.message);
-      failedCount++;
+      failedCount--;
     } else {
       console.log(`${email}: wysłano (id: ${data.id})`);
killedBy: runDigest Resend error: returns failedCount equal to subscribers count
statusReason: expected -1 to be 1 // Object.is equality

[Survived] BlockStatement
scripts/send.ts:61:12
     if (error) {
       console.error(`${email}: Resend error:`, error.message);
       failedCount++;
-    } else {
-      console.log(`${email}: wysłano (id: ${data.id})`);
-    }
+    } else {}
   }
 

[Survived] StringLiteral
scripts/send.ts:62:19
       console.error(`${email}: Resend error:`, error.message);
       failedCount++;
     } else {
-      console.log(`${email}: wysłano (id: ${data.id})`);
+      console.log(``);
     }
   }

[Survived] ArrowFunction
scripts/send.ts:71:20
     .update({ digest_sent_at: new Date().toISOString() })
     .in(
       "id",
-      articles.map((a) => a.id),
+      articles.map(() => undefined),
     );
 

[Killed] ConditionalExpression
scripts/send.ts:74:7
       articles.map((a) => a.id),
     );
 
-  if (updateError) {
+  if (true) {
     // do not exit — articles are considered "sent" regardless of mark failure
     console.error("Failed to mark articles as sent:", updateError.message);
killedBy: runDigest Resend error: returns failedCount equal to subscribers count
statusReason: Cannot read properties of null (reading 'message')

[NoCoverage] BlockStatement
scripts/send.ts:74:20
       articles.map((a) => a.id),
     );
 
-  if (updateError) {
-    // do not exit — articles are considered "sent" regardless of mark failure
-    console.error("Failed to mark articles as sent:", updateError.message);
-  }
+  if (updateError) {}
 
   return { failedCount };

[Survived] EqualityOperator
scripts/send.ts:83:5
 }
 
 const __filename = fileURLToPath(import.meta.url);
-if (process.argv[1] === __filename) {
+if (process.argv[1] !== __filename) {
   const supabaseUrl = process.env.SUPABASE_URL;
   const supabaseServiceRoleKey = process.env.SUPABASE_SERVICE_ROLE_KEY;

[NoCoverage] BooleanLiteral
scripts/send.ts:89:50
   const resendApiKey = process.env.RESEND_API_KEY;
   const resendFromEmail = process.env.RESEND_FROM_EMAIL;
 
-  if (!supabaseUrl || !supabaseServiceRoleKey || !resendApiKey || !resendFromEmail) {
+  if (!supabaseUrl || !supabaseServiceRoleKey || resendApiKey || !resendFromEmail) {
     console.error(
       "Error: SUPABASE_URL, SUPABASE_SERVICE_ROLE_KEY, RESEND_API_KEY, and RESEND_FROM_EMAIL must be set in .env",

[NoCoverage] LogicalOperator
scripts/send.ts:89:7
   const resendApiKey = process.env.RESEND_API_KEY;
   const resendFromEmail = process.env.RESEND_FROM_EMAIL;
 
-  if (!supabaseUrl || !supabaseServiceRoleKey || !resendApiKey || !resendFromEmail) {
+  if ((!supabaseUrl || !supabaseServiceRoleKey) && !resendApiKey || !resendFromEmail) {
     console.error(
       "Error: SUPABASE_URL, SUPABASE_SERVICE_ROLE_KEY, RESEND_API_KEY, and RESEND_FROM_EMAIL must be set in .env",

[NoCoverage] BlockStatement
scripts/send.ts:97:7
   }
 
   let subscribers: Subscribers;
-  try {
-    const raw = readFileSync("subscribers.json", "utf-8");
-    subscribers = SubscribersSchema.parse(JSON.parse(raw));
-  } catch (err) {
+  try {} catch (err) {
     console.error("Error loading subscribers.json:", err instanceof Error ? err.message : String(err));
     process.exit(1);

[NoCoverage] BlockStatement
scripts/send.ts:100:17
   try {
     const raw = readFileSync("subscribers.json", "utf-8");
     subscribers = SubscribersSchema.parse(JSON.parse(raw));
-  } catch (err) {
-    console.error("Error loading subscribers.json:", err instanceof Error ? err.message : String(err));
-    process.exit(1);
-  }
+  } catch (err) {}
 
   const supabase = createScriptClient(supabaseUrl, supabaseServiceRoleKey);

[NoCoverage] StringLiteral
scripts/send.ts:101:19
     const raw = readFileSync("subscribers.json", "utf-8");
     subscribers = SubscribersSchema.parse(JSON.parse(raw));
   } catch (err) {
-    console.error("Error loading subscribers.json:", err instanceof Error ? err.message : String(err));
+    console.error("", err instanceof Error ? err.message : String(err));
     process.exit(1);
   }

[NoCoverage] StringLiteral
scripts/send.ts:108:15
   const supabase = createScriptClient(supabaseUrl, supabaseServiceRoleKey);
   const resend = new Resend(resendApiKey);
 
-  console.log("Digest starting…");
+  console.log("");
 
   // Articles older than 24h with digest_sent_at IS NULL are intentionally skipped — they age out silently.

[NoCoverage] ArithmeticOperator
scripts/send.ts:111:27
   console.log("Digest starting…");
 
   // Articles older than 24h with digest_sent_at IS NULL are intentionally skipped — they age out silently.
-  const cutoff = new Date(Date.now() - 86_400_000).toISOString();
+  const cutoff = new Date(Date.now() + 86_400_000).toISOString();
 
   const { data: articles, error: queryError } = await supabase

[NoCoverage] BooleanLiteral
scripts/send.ts:118:36
     .select("id, source_url, article_url, title, lead")
     .is("digest_sent_at", null)
     .gt("seen_at", cutoff)
-    .order("seen_at", { ascending: true });
+    .order("seen_at", { ascending: false });
 
   if (queryError) {

[NoCoverage] StringLiteral
scripts/send.ts:118:12
     .select("id, source_url, article_url, title, lead")
     .is("digest_sent_at", null)
     .gt("seen_at", cutoff)
-    .order("seen_at", { ascending: true });
+    .order("", { ascending: true });
 
   if (queryError) {

[NoCoverage] BlockStatement
scripts/send.ts:120:19
     .gt("seen_at", cutoff)
     .order("seen_at", { ascending: true });
 
-  if (queryError) {
-    console.error("Supabase query error:", queryError.message);
-    process.exit(1);
-  }
+  if (queryError) {}
 
   if (articles.length === 0) {

[NoCoverage] ConditionalExpression
scripts/send.ts:120:7
     .gt("seen_at", cutoff)
     .order("seen_at", { ascending: true });
 
-  if (queryError) {
+  if (true) {
     console.error("Supabase query error:", queryError.message);
     process.exit(1);

[NoCoverage] StringLiteral
scripts/send.ts:121:19
     .order("seen_at", { ascending: true });
 
   if (queryError) {
-    console.error("Supabase query error:", queryError.message);
+    console.error("", queryError.message);
     process.exit(1);
   }

[NoCoverage] ConditionalExpression
scripts/send.ts:125:7
     process.exit(1);
   }
 
-  if (articles.length === 0) {
+  if (true) {
     console.log("Brak nowych artykułów w ostatnich 24h, pomijam wysyłkę.");
     process.exit(0);

[NoCoverage] EqualityOperator
scripts/send.ts:135:7
   console.log("---");
   console.log(`Wysłano: ${articles.length} artykułów → ${subscribers.length} subskrybentów`);
 
-  if (failedCount > 0) process.exit(1);
+  if (failedCount <= 0) process.exit(1);
 }
 

[NoCoverage] ConditionalExpression
scripts/send.ts:135:7
   console.log("---");
   console.log(`Wysłano: ${articles.length} artykułów → ${subscribers.length} subskrybentów`);
 
-  if (failedCount > 0) process.exit(1);
+  if (true) process.exit(1);
 }
 
