[NoCoverage] BlockStatement
src/lib/services/articles.ts:3:63
 import type { SupabaseClient } from "@supabase/supabase-js";
 
-export async function fetchArticles(supabase: SupabaseClient) {
-  return supabase
-    .from("articles_seen")
-    .select("id, source_url, article_url, title, lead, seen_at, digest_sent_at")
-    .order("seen_at", { ascending: false })
-    .limit(50);
-}
+export async function fetchArticles(supabase: SupabaseClient) {}
 

[NoCoverage] StringLiteral
src/lib/services/articles.ts:6:13
 export async function fetchArticles(supabase: SupabaseClient) {
   return supabase
     .from("articles_seen")
-    .select("id, source_url, article_url, title, lead, seen_at, digest_sent_at")
+    .select("")
     .order("seen_at", { ascending: false })
     .limit(50);

[NoCoverage] BooleanLiteral
src/lib/services/articles.ts:7:36
   return supabase
     .from("articles_seen")
     .select("id, source_url, article_url, title, lead, seen_at, digest_sent_at")
-    .order("seen_at", { ascending: false })
+    .order("seen_at", { ascending: true })
     .limit(50);
 }

[NoCoverage] StringLiteral
src/lib/services/articles.ts:7:12
   return supabase
     .from("articles_seen")
     .select("id, source_url, article_url, title, lead, seen_at, digest_sent_at")
-    .order("seen_at", { ascending: false })
+    .order("", { ascending: false })
     .limit(50);
 }
