[NoCoverage] BlockStatement
src/lib/supabase.ts:5:78
 import type { AstroCookies } from "astro";
 import { SUPABASE_URL, SUPABASE_KEY } from "astro:env/server";
 
-export function createClient(requestHeaders: Headers, cookies: AstroCookies) {
-  if (!SUPABASE_URL || !SUPABASE_KEY) {
-    return null;
-  }
-  return createServerClient(SUPABASE_URL, SUPABASE_KEY, {
-    cookies: {
-      getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
-          name,
-          value: value ?? "",
-        }));
-      },
-      setAll(cookiesToSet) {
-        cookiesToSet.forEach(({ name, value, options }) => {
-          cookies.set(name, value, options);
-        });
-      },
-    },
-  });
-}
+export function createClient(requestHeaders: Headers, cookies: AstroCookies) {}
 

[NoCoverage] ObjectLiteral
src/lib/supabase.ts:10:14
     return null;
   }
   return createServerClient(SUPABASE_URL, SUPABASE_KEY, {
-    cookies: {
-      getAll() {
-        return parseCookieHeader(requestHeaders.get("Cookie") ?? "").map(({ name, value }) => ({
-          name,
-          value: value ?? "",
-        }));
-      },
-      setAll(cookiesToSet) {
-        cookiesToSet.forEach(({ name, value, options }) => {
-          cookies.set(name, value, options);
-        });
-      },
-    },
+    cookies: {},
   });
 }
